/***********************************************************
 *
 *
 * *********************************************************/
extern "C"
{
#include <libavcodec/avcodec.h>
#include <libswscale/swscale.h>
#include <libavutil/pixfmt.h>
#include <libavutil/opt.h>
#include <libavutil/time.h>
#include <libavutil/imgutils.h>
#include <libavformat/avformat.h>
}
#include <signal.h>
#include <unistd.h>
#include <assert.h>
#include <thread>
#include <cstring>
#include <iostream>
#include <arpa/inet.h>
#include <time.h>
#include <errno.h>
#include <queue>
#include <mutex>
#include <condition_variable>
#include "view.h"
#include "fun.h"
#include "yuvtobgr.h"
#include "watermark.h"
#include "encoder_cuda.h"
#include <vector>
#include <thread>
#include <X11/Xlib.h>

static Uint32 SDL_VIDEO_Flags = SDL_ANYFORMAT | SDL_DOUBLEBUF | SDL_RESIZABLE | SDL_HWSURFACE;
static volatile int main_exit = 0;
uint8_t sdl_flag;

using namespace cameraview;

#define BYTE1 __attribute__((packed, aligned(1)))
#define UNUSED(x) (void)x

#define BOARDMAX 4
#define CHANELMAX 8
typedef struct _encoder{
    AVCodec *codec;
   AVCodecContext *codec_ctx;
}enCoder;
enCoder encoder;

typedef struct _enPara{
   AVFrame *srcframe;
   AVFrame *dstframe;
   SwsContext *sws_ctx;
   AVCodec *codec;
   AVCodecContext *codec_ctx;
   AVFormatContext *out_fmt_ctx;
   AVOutputFormat *out_fmt;
   AVStream *out_stream;
   AVPacket *pkt;
   int frame_count;
}EnPara;
EnPara  enPara[BOARDMAX][8];

int     creathreadfg[BOARDMAX][8];
int     encodeflag[BOARDMAX][8];
int     fileindex[BOARDMAX][8];
int     filefullflag[BOARDMAX][8];
long    filesize[BOARDMAX][8];
int     srcframecount[BOARDMAX][8];
int     enframecount[BOARDMAX][8];
FILE    *fp[BOARDMAX][8];
int wflag[BOARDMAX][8];
int wflag1[BOARDMAX][8];
int64_t start_time[BOARDMAX][8], end_time[BOARDMAX][8];
double duration[BOARDMAX][8], fps[BOARDMAX][8];


array <shared_ptr<thread>, 8> encodeThread[BOARDMAX];
std::queue<frameInfo> dataQueue[BOARDMAX][8];   
std::mutex mtx[BOARDMAX][8];                         
std::condition_variable condVarReady[BOARDMAX][8];             

array <shared_ptr<thread>, 8> f_enc_pthread;
std::queue<frameInfo> f_dataQueue[8];   
std::mutex f_mtx[8];                         
std::condition_variable f_cv[8];     

typedef struct _GlobalVar{
    int width[BOARDMAX];
    int height[BOARDMAX];
    unsigned int chan_mask[BOARDMAX];  // 0x1 bitset 1 indicate a camera
    unsigned int trigger_mode;  // 0: freerun   1: senconds-justified
    unsigned int is_save_buf;
    unsigned int save_h264;
    unsigned int print_time_stamp;
    unsigned int pixel_format;//0:YUYV 1:Gray16le
    unsigned int region_x; //1~4
    unsigned int region_y; //1~4
    unsigned int sdl_chan;
    unsigned int multi_chan;
    unsigned int playMode;
    unsigned int show;
}GlobalVar;

GlobalVar globalset;

typedef struct _AncillaryData
{
    unsigned char header[4];//4
    unsigned char payloadMajorVersion;
    unsigned char payloadMinorVersion; //6
    unsigned short payloadNumBytes; //8
    unsigned int gw5State;//12
    float gw5Temperature;//16
    unsigned int inputFrameErrorCount;//20
    unsigned int inputFrameCount;//24
    unsigned int inputFrameCrc; //28
    long long inputFrameTimestampMs; //36
    unsigned int outputFrameCount;//40
    unsigned int outputFrameCrc; //44
    long long outputFrameTimestampMs;//52
    float totalGain[4];//68
    float sensorGain[4];//84
    float ispGain[4];//100
    float unclippedEv[4];//116
    float unclippedEvAvg;//120
    unsigned short intergrationLines[4];//128
    unsigned short vts;//130
    unsigned char padAe[2];//132
    float frameRate;//136
 }BYTE1 AncillaryData;
AncillaryData g_anc_illary_date;
typedef struct  _AncDate
{
    /* data */
    unsigned int frame_count;
    unsigned int frame_trig_sync_s;
    unsigned int frame_trig_sync_ns;
    unsigned int frame_rev_sync_s;
    unsigned int frame_rev_sync_ns;
    unsigned int frame_cache_irq_s;
    unsigned int frame_cache_irq_ns;
    unsigned int frame_pc_ack;
    unsigned int frame_dma_trans;
}AncData;
AncData g_anc_date;

static int image_index[BOARDMAX][CHANELMAX] = {0};
static int framecount[BOARDMAX][CHANELMAX] = {0};

void save_image(int board, int channel, frameInfo* frame);
void save_image_8(int board, int channel, frameInfo* frame);
void save_image_16(int board, int channel, frameInfo* frame);
void save_image_16_t(int board, int channel, frameInfo* frame);

int sw_encodetoh264(EnPara enpara[][8], int board, int channel, frameInfo* frame);
int sw_encodetoh264init(EnPara enpara[][8], int board, int channel, frameInfo* frame);
